package org.jakumo.euler.e015;

//        Начиная в левом верхнем углу сетки 2×2 (имеется в виду 3х3)
//        и имея возможность двигаться только вниз или вправо,
//        существует ровно 6 маршрутов до правого нижнего угла сетки.
//
//        * * *
//        * * *
//        * * *
//
//        Сколько существует таких маршрутов в сетке 20×20 (21x21)?

public class Main {
    public static void main(String[] args) {
        long startTime = System.currentTimeMillis();

        //your code

        long timeSpent = System.currentTimeMillis() - startTime;
        System.out.println("\nExecution time: " + timeSpent + " ms");
    }
}
